## Plan Result (production - TerraformPlanApply)




<pre><code>Plan: 3 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.rg_1
  * azurerm_role_assignment.rg_2
  * azurerm_role_assignment.rg_3
* Update
  * module.storage.azurerm_storage_account.storage_account




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.rg_1 will be created
  + resource "azurerm_role_assignment" "rg_1" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "257ca1f6-7ef6-4e7d-b43b-cb2d4d849fdc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Reader"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/baubais-data-factory-rg-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rg_2 will be created
  + resource "azurerm_role_assignment" "rg_2" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "257ca1f6-7ef6-4e7d-b43b-cb2d4d849fdc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/baubais-data-factory-rg-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rg_3 will be created
  + resource "azurerm_role_assignment" "rg_3" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "257ca1f6-7ef6-4e7d-b43b-cb2d4d849fdc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Reader"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/baubais-data-factory-rg-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/baubais-data-factory-rg-prod/providers/Microsoft.Storage/storageAccounts/synapsebaubaisprod"
        name                               = "synapsebaubaisprod"
        tags                               = {
            "application"  = "baubais"
            "builtFrom"    = "hmcts/juror-er-infra"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":22,"Program":"tfcmt","SHA1":"","Target":"production - TerraformPlanApply","Vars":{}} -->